["```\n    let GetAllHostsbyAccount = (v_Account_Name:string){\n      SigninLogs\n      | extend v_Account_Name = case(\n      v_Account_Name has '@', tostring(split(v_Account_Name, '@')[0]),\n      v_Account_Name has '\\\\', tostring(split(v_Account_Name, '\\\\')[1]),\n      v_Account_Name\n      )\n      | where UserPrincipalName contains v_Account_Name\n      | extend RemoteHost = tolower(tostring(parsejson(DeviceDetail.['displayName'])))\n      | extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser\n      | extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)\n      | extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)\n      | extend info = pack('UserDisplayName', UserDisplayName, 'UserPrincipalName', UserPrincipalName, 'AppDisplayName', AppDisplayName, 'ClientAppUsed', ClientAppUsed, 'Browser', tostring(Browser), 'IPAddress', IPAddress, 'ResultType', ResultType, 'ResultDescription', ResultDescription, 'Location', Location, 'State', State, 'City', City, 'StatusCode', StatusCode, 'StatusDetails', StatusDetails)\n      | summarize min(TimeGenerated), max(TimeGenerated), Host_Aux_info = makeset(info) by RemoteHost , tostring(OS)\n      | project min_TimeGenerated, max_TimeGenerated, RemoteHost, OS, Host_Aux_info\n      | top 10 by min_TimeGenerated desc nulls last \n      | project-rename Host_UnstructuredName=RemoteHost, Host_OSVersion=OS\n      };\n      // change <Name> value below\n      GetAllHostsbyAccount('<Name>')\n    ```"]